@echo off

chcp 65001 > nul

setlocal

echo ====================================================================

echo   ВАНКЛИК ЗАПУСК: ЛАБОРАТОРНАЯ РАБОТА №3

echo   Принципы организации грид-систем на платформе BOINC

echo   Автор: Эрденко М. Д. (ПО-32б) -- Преподаватель: Степаков В. И.

echo ====================================================================

echo.

set "PYTHONIOENCODING=utf-8"

python boinc_calculations.py

echo.

echo ====================================================================

echo   ДЕМОНСТРАЦИЯ ЗАВЕРШЕНА!

echo ====================================================================

pause


